[
    {
        "question1": "Select the correct set of options. These are the initial settings for the default security group:",
        "answer": "A",
        "list": {
            "A": "Allow no inbound traffic, Allow all outbound traffic and Allow instances associated with this security group to talk to each other",
            "B": "Allow all inbound traffic, Allow no outbound traffic and Allow instances associated with this security group to talk to each other",
            "C": "Allow no inbound traffic, Allow all outbound traffic and Does NOT allow instances associated with this security group to talk to each other",
            "D": "Allow all inbound traffic, Allow all outbound traffic and Does NOT allow instances associated with this security group to talk to each other"
        }
    },
    {
        "question1": "What does Amazon Route53 provide?",
        "answer": "C",
        "list": {
            "A": "A global Content Delivery Network.",
            "B": "None of these.",
            "C": "A scalable Domain Name System.",
            "D": "An SSH endpoint for Amazon EC2."
        }
    },
    {
        "question1": "What does Amazon ElastiCache provide?",
        "answer": "C",
        "list": {
            "A": "A service by this name doesn't exist. Perhaps you mean Amazon CloudCache.",
            "B": "A virtual server with a huge amount of memory.",
            "C": "A managed In-memory cache service.",
            "D": "An Amazon EC2 instance with the Memcached software already pre-installed."
        }
    },
    {
        "question1": "How many Elastic IP by default in Amazon Account?",
        "answer": "D",
        "list": {
            "A": "1 Elastic IP",
            "B": "3 Elastic IP",
            "C": "5 Elastic IP",
            "D": "0 Elastic IP"
        }
    },
    {
        "question1": "What is a Security Group?",
        "answer": "D",
        "list": {
            "A": "None of these.",
            "B": "A list of users that can access Amazon EC2 instances.",
            "C": "An Access Control List (ACL) for AWS resources.",
            "D": "A firewall for inbound traffic, built-in around every Amazon EC2 instance."
        }
    },
    {
        "question1": "The one-time payment for Reserved Instances is _____ refundable if the reservation is cancelled.",
        "answer": "C",
        "list": {
            "A": "always",
            "B": "in some circumstances",
            "C": "never"
        }
    },
    {
        "question1": "Please select the Amazon EC2 resource which can be tagged.",
        "answer": "D",
        "list": {
            "A": "key pairs",
            "B": "Elastic IP addresses",
            "C": "placement groups",
            "D": "Amazon EBS snapshots"
        }
    },
    {
        "question1": "What is Amazon Glacier?",
        "answer": "C",
        "list": {
            "A": "It's a security tool that allows to \"freeze\" an EC2 instance and perform computer forensics on it.",
            "B": "A security tool that allows to \"freeze\" an EBS volume and perform computer forensics on it.",
            "C": "A low-cost storage service that provides secure and durable storage for data archiving and backup.",
            "D": "You mean Amazon \"Iceberg\": it's a low-cost storage service."
        }
    },
    {
        "question1": "If an Amazon EBS volume is the root device of an instance, can I detach it without stopping the instance?",
        "answer": "B",
        "note": "http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ebs-detaching-volume.html",
        "list": {
            "A": "Yes but only if Windows instance",
            "B": "No",
            "C": "Yes",
            "D": "Yes but only if a Linux instance"
        }
    },
    {
        "question1": "If you are using Amazon RDS Provisioned IOPS storage with MySQL and Oracle database engines, you can scale the throughput of your database Instance by specifying the IOPS rate from _____ .",
        "answer": "D",
        "note": "http://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/USER_PIOPS.html",
        "list": {
            "A": "1,000 to 1,00,000",
            "B": "100 to 1,000",
            "C": "10,000 to 1,00,000",
            "D": "1,000 to 10,000"
        }
    },
    {
        "question1": "Every user you create in the IAM system starts with ______.",
        "answer": "B",
        "list": {
            "A": "full permissions",
            "B": "no permissions",
            "C": "partial permissions"
        }
    },
    {
        "question1": "After an Amazon VPC instance is launched, can I change the VPC security groups it belongs to?",
        "answer": "B",
        "list": {
            "A": "Only if the tag \"VPC_Change_Group\" is true",
            "B": "Yes. You can.",
            "C": "No. You cannot.",
            "D": "Only if the tag \"VPC Change Group\" is true"
        }
    },
    {
        "question1": "A______- is an individual, system, or application that interacts with AWS programmatically.",
        "answer": "A",
        "list": {
            "A": "user",
            "B": "AWS Account",
            "C": "Group",
            "D": "Role"
        }
    },
    {
        "question1": "Select the correct statement:",
        "answer": "C",
        "list": {
            "A": "You don't need not specify the resource identifier while stopping a resource",
            "B": "You can terminate, stop, or delete a resource based solely on its tags",
            "C": "You can't terminate, stop, or delete a resource based solely on its tags",
            "D": "You don't need to specify the resource identifier while terminating a resource"
        }
    },
    {
        "question1": "Amazon EC2 has no Amazon Resource Names (ARNs) because you can't specify a particular Amazon EC2 resource in an IAM policy. True or False?",
        "answer": "A",
        "list": {
            "A": "TRUE",
            "B": "FALSE"
        }
    },
    {
        "question1": "Can I initiate a \"forced failover\" for my MySQL Multi-AZ DB Instance deployment?",
        "answer": "C",
        "list": {
            "A": "Only in certain regions",
            "B": "Only in VPC",
            "C": "Yes",
            "D": "No"
        }
    },
    {
        "question1": "A group can contain many users. Can a user belong to multiple groups?",
        "answer": "A",
        "list": {
            "A": "Yes always",
            "B": "No",
            "C": "Yes but only if they are using two factor authentication",
            "D": "Yes but only in VPC"
        }
    },
    {
        "question1": "Is the encryption of connections between my application and my DB Instance using SSL for the MySQL server engines available?",
        "answer": "A",
        "note": "PROMPT> mysql -h myinstance.mydnsnameexample.rds.amazonaws.com --ssl_ca=cert-rds-ssl-ca.pem",
        "list": {
            "A": "Yes",
            "B": "Only in VPC",
            "C": "Only in certain regions",
            "D": "No"
        }
    },
    {
        "question1": "Which AWS instance address has the following characteristics? :\"If you stop an instance, its Elastic IP address is unmapped, and you must remap it when you restart the instance.\"",
        "answer": "D",
        "list": {
            "A": "Both A and B",
            "B": "None of these",
            "C": "VPC Addresses",
            "D": "EC2 Addresses"
        }
    },
    {
        "question1": "True or False: Common points of failures like generators and cooling equipment are shared across Availability Zones.",
        "answer": "B",
        "list": {
            "A": "TRUE",
            "B": "FALSE"
        }
    },
    {
        "question1": "Please select the most correct answer regarding the persistence of the Amazon Instance Store",
        "answer": "A",
        "list": {
            "A": "The data on an instance store volume persists only during the life of the associated Amazon EC2 instance",
            "B": "The data on an instance store volume is lost when the security group rule of the associated instance is changed.",
            "C": "The data on an instance store volume persists even after associated Amazon EC2 instance is deleted"
        }
    },
    {
        "question1": "Multi-AZ deployment _____ supported for Microsoft SQL Server DB Instances.",
        "answer": "B",
        "list": {
            "A": "is not currently",
            "B": "using SQL Server Mirroring as a high-availability, failover solution",
            "C": "will never be"
        }
    },
    {
        "question1": "Security groups act like a firewall at the instance level, whereas _____ are an additional layer of security that act at the subnet level.",
        "answer": "C",
        "list": {
            "A": "DB Security Groups",
            "B": "VPC Security Groups",
            "C": "network ACLs"
        }
    },
    {
        "question1": "Does AWS allow for the use of Multi Factor Authentication tokens?",
        "answer": "A",
        "list": {
            "A": "Yes, with both hardware or virtual MFA devices.",
            "B": "Yes, but it offers only virtual MFA devices.",
            "C": "Yes, but it offers only physical (hardware) MFA devices.",
            "D": "No."
        }
    },
    {
        "question1": "What does Amazon SWF stand for?",
        "answer": "C",
        "list": {
            "A": "Simple Wireless Forms",
            "B": "Simple Web Form",
            "C": "Simple Work Flow",
            "D": "Simple Web Flow"
        }
    },
    {
        "question1": "What does Amazon Elastic Beanstalk provide?",
        "answer": "A",
        "list": {
            "A": "An application container on top of Amazon Web Services.",
            "B": "A scalable storage appliance on top of Amazon Web Services.",
            "C": "A scalable cluster of EC2 instances.",
            "D": "A service by this name doesn't exist."
        }
    },
    {
        "question1": "Is the SQL Server Audit feature supported in the Amazon RDS SQL Server engine?",
        "answer": "A",
        "list": {
            "A": "No",
            "B": "Yes"
        }
    },
    {
        "question1": "Are you able to integrate a multi-factor token service with the AWS Platform?",
        "answer": "A",
        "list": {
            "A": "Yes, using the AWS multi-factor token devices to authenticate users on the AWS platform.",
            "B": "No, you cannot integrate multi-factor token devices with the AWS platform.",
            "C": "Yes, you can integrate private multi-factor token devices to authenticate users to the AWS platform."
        }
    },
    {
        "question1": "My Read Replica appears \"stuck\" after a Multi-AZ failover and is unable to obtain or apply updates from the source DB Instance. What do I do?",
        "answer": "A",
        "list": {
            "A": "You will need to delete the Read Replica and create a new one to replace it.",
            "B": "You will need to disassociate the DB Engine and re associate it.",
            "C": "The instance should be deployed to Single AZ and then moved to Multi- AZ once again",
            "D": "You will need to delete the DB Instance and create a new one to replace it."
        }
    },
    {
        "question1": "Which DNS name can only be resolved within Amazon EC2?",
        "answer": "A",
        "list": {
            "A": "Internal DNS name",
            "B": "External DNS name",
            "C": "Global DNS name",
            "D": "Private DNS name"
        }
    },
    {
        "question1": "If your DB instance runs out of storage space or file system resources, its status will change to_____ and your DB Instance will no longer be available.",
        "answer": "B",
        "list": {
            "A": "storage-overflow",
            "B": "storage-full",
            "C": "storage-exceed",
            "D": "storage-overage"
        }
    },
    {
        "question1": "Is it possible to access your EBS snapshots?",
        "answer": "B",
        "list": {
            "A": "Yes, through the Amazon S3 APIs.",
            "B": "Yes, through the Amazon EC2 APIs.",
            "C": "No, EBS snapshots cannot be accessed; they can only be used to create a new EBS volume.",
            "D": "EBS doesn't provide snapshots."
        }
    },
    {
        "question1": "Will my standby RDS instance be in the same Availability Zone as my primary?",
        "answer": "D",
        "list": {
            "A": "Only for Oracle RDS types",
            "B": "Only if configured at launch",
            "C": "Yes",
            "D": "No"
        }
    },
    {
        "question1": "Does Amazon RDS for SQL Server currently support importing data into the msdb database?",
        "answer": "A",
        "list": {
            "A": "No",
            "B": "Yes"
        }
    },
    {
        "question1": "Does Route 53 support MX Records?",
        "answer": "A",
        "note": "The AWS Management Console now includes complete support for Amazon Route 53. You can now create your hosted zones and set up the appropriate records (A, CNAME, MX, and so forth) in a convenient visual environment. http://aws.typepad.com/aws/route-53/",
        "list": {
            "A": "Yes.",
            "B": "It supports CNAME records, but not MX records.",
            "C": "No",
            "D": "Only Primary MX records. Secondary MX records are not supported."
        }
    },
    {
        "question1": "Because of the extensibility limitations of striped storage attached to Windows Server, Amazon RDS does not currently support increasing storage on a _____ DB Instance.",
        "answer": "A",
        "list": {
            "A": "SQL Server",
            "B": "MySQL",
            "C": "Oracle"
        }
    },
    {
        "question1": "How can I change the security group membership for interfaces owned by other AWS, such as Elastic Load Balancing?",
        "answer": "B",
        "list": {
            "A": "using all these methods",
            "B": "By using the service specific console or API\\CLI commands",
            "C": "None of these"
        }
    },
    {
        "question1": "True or False: When you perform a restore operation to a point in time or from a DB Snapshot, a new DB Instance is created with a new endpoint.",
        "answer": "B",
        "list": {
            "A": "FALSE",
            "B": "TRUE"
        }
    },
    {
        "question1": "Which Amazon storage do you think is the best for my database-style applications that frequently encounter many random reads and writes across the dataset.",
        "answer": "D",
        "list": {
            "A": "None of these.",
            "B": "Amazon Instance Storage",
            "C": "Any of these",
            "D": "Amazon EBS"
        }
    },
    {
        "question1": "In a management network scenario the which interface on the instance handles public-facing traffic?",
        "answer": "C",
        "note": "http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/using-eni.html",
        "list": {
            "A": "Primary network interface",
            "B": "Subnet interface",
            "C": "Secondary network interface"
        }
    },
    {
        "question1": "Select the correct set of steps for exposing the snapshot only to specific AWS accounts",
        "answer": "B",
        "list": {
            "A": "Select public for all the accounts and check mark those accounts with whom you want to expose the snapshots and click save.",
            "B": "SelectPrivate, enter the IDs of those AWS accounts, and clickSave",
            "C": "SelectPublic, enter the IDs of those AWS accounts, and clickSave.",
            "D": "SelectPublic, mark the IDs of those AWS accounts as private, and clickSave."
        }
    },
    {
        "question1": "Is decreasing the storage size of a DB Instance permitted?",
        "answer": "B",
        "list": {
            "A": "Depends on the RDMS used",
            "B": "Yes",
            "C": "No"
        }
    },
    {
        "question1": "When should I choose Provisioned IOPS over Standard RDS storage?",
        "answer": "A",
        "list": {
            "A": "If you use production online transaction processing (OLTP) workloads.",
            "B": "If you have batch-oriented workloads",
            "C": "If you have workloads that are not sensitive to consistent performance"
        }
    },
    {
        "question1": "In the context of MySQL, version numbers are organized as MySQL version = X.Y.Z. What does X denote here??",
        "answer": "D",
        "list": {
            "A": "release level",
            "B": "minor version",
            "C": "version number",
            "D": "major version"
        }
    },
    {
        "question1": "It is advised that you watch the Amazon CloudWatch \"_____\" metric (available via the AWS Management Console or Amazon Cloud Watch APIs) carefully and recreate the Read Replica should it fall behind due to replication errors.",
        "answer": "C",
        "list": {
            "A": "Write Lag",
            "B": "Read Replica",
            "C": "Replica Lag",
            "D": "Single Replica"
        }
    },
    {
        "question1": "By default what are ENIs that are automatically created and attached to instances using the EC2 console set to do when the attached instance terminates?",
        "answer": "B",
        "list": {
            "A": "Remain as is",
            "B": "Terminate",
            "C": "Hibernate",
            "D": "Pause"
        }
    },
    {
        "question1": "Are you able to integrate a multi-factor token service with the AWS Platform?",
        "answer": "C",
        "list": {
            "A": "Yes, you can integrate private multi-factor token devices to authenticate users to the AWS platform.",
            "B": "No, you cannot integrate multi-factor token devices with the AWS platform.",
            "C": "Yes, using the AWS multi-factor token devices to authenticate users on the AWS platform."
        }
    },
    {
        "question1": "You can use _____ and _____ to help secure the instances in your VPC.",
        "answer": "D",
        "list": {
            "A": "security groups and multi-factor authentication",
            "B": "security groups and 2-Factor authentication",
            "C": "security groups and biometric authentication",
            "D": "security groups and network ACLs"
        }
    },
    {
        "question1": "Fill in the blanks: _____ is a durable, block-level storage volume that you can attach to a single, running Amazon EC2 instance.",
        "answer": "B",
        "list": {
            "A": "Amazon S3",
            "B": "Amazon EBS",
            "C": "None of these.",
            "D": "All of these"
        }
    },
    {
        "question1": "Do the Amazon EBS volumes persist independently from the running life of an Amazon EC2 instance?",
        "answer": "C",
        "list": {
            "A": "No",
            "B": "Only if instructed to when created",
            "C": "Yes"
        }
    },
    {
        "question1": "If I want my instance to run on a signle-tenant hardware, which value do I have to set the instance's tenancy attribute to?",
        "answer": "A",
        "list": {
            "A": "dedicated",
            "B": "isolated",
            "C": "one",
            "D": "reserved"
        }
    },
    {
        "question1": "What does the following command do with respect to the Amazon EC2 security groups? ec2-create-group CreateSecurityGroup",
        "answer": "B",
        "note": "EC2-Classic: You can have up to 500 security groups. EC2-VPC: You can create up to 100 security groups per VPC.",
        "list": {
            "A": "Creates a new rule inside the security group.",
            "B": "Creates a new security group for use with your account.",
            "C": "Creates a new group inside the security group.",
            "D": "Groups the user created security groups in to a new group for easy access."
        }
    },
    {
        "question1": "What is the maximum response time for a Business level Premium Support case?",
        "answer": "D",
        "list": {
            "A": "30 minutes",
            "B": "You always get instant responses (within a few seconds).",
            "C": "10 minutes",
            "D": "1 hour"
        }
    },
    {
        "question1": "What does Amazon ELB stand for?",
        "answer": "D",
        "list": {
            "A": "Elastic Linux Box.",
            "B": "Encrypted Linux Box.",
            "C": "Encrypted Load Balancing.",
            "D": "Elastic Load Balancing."
        }
    },
    {
        "question1": "What does Amazon CloudFormation provide?",
        "answer": "D",
        "list": {
            "A": "None of these.",
            "B": "The ability to setup Autoscaling for Amazon EC2 instances.",
            "C": "A template to map network resources for Amazon Web Services.",
            "D": "A template resource creation for Amazon Web Services."
        }
    },
    {
        "question1": "Is there a limit to the number of groups you can have?",
        "answer": "D",
        "list": {
            "A": "Yes for all users except root",
            "B": "No",
            "C": "Yes unless special permission granted",
            "D": "Yes for all users"
        }
    },
    {
        "question1": "Location of Instances are _____",
        "answer": "B",
        "list": {
            "A": "Regional",
            "B": "based on Availability Zone",
            "C": "Global"
        }
    },
    {
        "question1": "Is there any way to own a direct connection to Amazon Web Services?",
        "answer": "D",
        "list": {
            "A": "You can create an encrypted tunnel to VPC, but you don't own the connection.",
            "B": "Yes, it's called Amazon Dedicated Connection.",
            "C": "No, AWS only allows access from the public Internet.",
            "D": "Yes, it's called Direct Connect."
        }
    },
    {
        "question1": "What is the maximum response time for a Business level Premium Support case?",
        "answer": "B",
        "list": {
            "A": "30 minutes",
            "B": "1 hour",
            "C": "12 hours",
            "D": "10 minutes"
        }
    },
    {
        "question1": "You must assign each server to at least _____ security group",
        "answer": "C",
        "list": {
            "A": "4",
            "B": "3",
            "C": "1",
            "D": "2"
        }
    },
    {
        "question1": "Does DynamoDB support in-place atomic updates?",
        "answer": "C",
        "list": {
            "A": "It is not defined",
            "B": "No",
            "C": "Yes",
            "D": "It does support in-place non-atomic updates"
        }
    },
    {
        "question1": "Is there a method in the IAM system to allow or deny access to a specific instance?",
        "answer": "C",
        "list": {
            "A": "Only for VPC based instances",
            "B": "Yes",
            "C": "No"
        }
    },
    {
        "question1": "What is an isolated database environment running in the cloud (Amazon RDS) called?",
        "answer": "A",
        "list": {
            "A": "DB Instance",
            "B": "DB Unit",
            "C": "DB Server",
            "D": "DB Volume"
        }
    },
    {
        "question1": "What does Amazon SES stand for?",
        "answer": "B",
        "list": {
            "A": "Simple Elastic Server.",
            "B": "Simple Email Service.",
            "C": "Software Email Solution.",
            "D": "Software Enabled Server."
        }
    },
    {
        "question1": "Amazon S3 doesn't automatically give a user who creates _____ permission to perform other actions on that bucket or object.",
        "answer": "B",
        "list": {
            "A": "a file",
            "B": "a bucket or object",
            "C": "a bucket or file",
            "D": "a object or file"
        }
    },
    {
        "question1": "Can I attach more than one policy to a particular entity?",
        "answer": "A",
        "list": {
            "A": "Yes always",
            "B": "Only if within GovCloud",
            "C": "No",
            "D": "Only if within VPC"
        }
    },
    {
        "question1": "Fill in the blanks: A_____ is a storage device that moves data in sequences of bytes or bits (blocks). Hint: These devices support random access and generally use buffered I/O.",
        "answer": "D",
        "list": {
            "A": "block map",
            "B": "storage block",
            "C": "mapping device",
            "D": "block device"
        }
    },
    {
        "question1": "Can I detach the primary (eth0) network interface when the instance is running or stopped?",
        "answer": "B",
        "list": {
            "A": "Yes. You can.",
            "B": "No. You cannot.",
            "C": "Depends on the state of the interface at the time"
        }
    },
    {
        "question1": "What's an ECU?",
        "answer": "D",
        "list": {
            "A": "Extended Cluster User.",
            "B": "None of these.",
            "C": "Elastic Computer Usage.",
            "D": "Elastic Compute Unit."
        }
    },
    {
        "question1": "What is the charge for the data transfer incurred in replicating data between your primary and standby?",
        "answer": "A",
        "list": {
            "A": "No charge. It is free.",
            "B": "Double the standard data transfer charge",
            "C": "Same as the standard data transfer charge",
            "D": "Half of the standard data transfer charge"
        }
    },
    {
        "question1": "Does AWS Direct Connect allow you access to all Availabilities Zones within a Region?",
        "answer": "C",
        "list": {
            "A": "Depends on the type of connection",
            "B": "No",
            "C": "Yes",
            "D": "Only when there's just one availability zone in a region. If there are more than one, only one availability zone can be accessed directly."
        }
    },
    {
        "question1": "How many types of block devices does Amazon EC2 support",
        "answer": "A",
        "list": {
            "A": "2",
            "B": "4",
            "C": "3",
            "D": "1"
        }
    },
    {
        "question1": "What does the \"Server Side Encryption\" option on Amazon S3 provide?",
        "answer": "C",
        "list": {
            "A": "It provides an encrypted virtual disk in the Cloud.",
            "B": "It doesn't exist for Amazon S3, but only for Amazon EC2.",
            "C": "It encrypts the files that you send to Amazon S3, on the server side.",
            "D": "It allows to upload files using an SSL endpoint, for a secure transfer."
        }
    },
    {
        "question1": "Within the IAM service a GROUP is regarded as a:",
        "answer": "D",
        "list": {
            "A": "A collection of AWS accounts",
            "B": "It's the group of EC2 machines that gain the permissions specified in the GROUP.",
            "C": "There's no GROUP in IAM, but only USERS and RESOURCES.",
            "D": "A collection of users."
        }
    },
    {
        "question1": "A_____is the concept of allowing (or disallowing) an entity such as a user, group, or role some type of access to one or more resources.",
        "answer": "D",
        "list": {
            "A": "user",
            "B": "AWS Account",
            "C": "resource",
            "D": "permission"
        }
    },
    {
        "question1": "After an Amazon VPC instance is launched, can I change the VPC security groups it belongs to?",
        "answer": "B",
        "list": {
            "A": "No. You cannot.",
            "B": "Yes. You can.",
            "C": "Only if you are the root user",
            "D": "Only if the tag \"VPC_Change_Group\" is true"
        }
    },
    {
        "question1": "Do the system resources on the Micro instance meet the recommended configuration for Oracle?",
        "answer": "C",
        "list": {
            "A": "Yes completely",
            "B": "Yes but only for certain situations",
            "C": "Not in any circumstance"
        }
    },
    {
        "question1": "Will I be charged if the DB instance is idle?",
        "answer": "B",
        "list": {
            "A": "No",
            "B": "Yes",
            "C": "Only is running in GovCloud",
            "D": "Only if running in VPC"
        }
    },
    {
        "question1": "If I write the below command, what does it do? ec2-run ami-e3a5408a -n 20 -g appserver",
        "answer": "B",
        "list": {
            "A": "Creates 20 rules in the security group named app server",
            "B": "Start twenty instances as members of appserver group.",
            "C": "Start 20 security groups",
            "D": "Terminate twenty instances as members of appserver group."
        }
    },
    {
        "question1": "Can I move a Reserved Instance from one Region to another?",
        "answer": "A",
        "list": {
            "A": "No",
            "B": "Yes",
            "C": "Only if they are moving into GovCloud",
            "D": "Only if they are moving to US East from another region"
        }
    },
    {
        "question1": "To help you manage your Amazon EC2 instances, images, and other Amazon EC2 resources, you can assign your own metadata to each resource in the form of_____",
        "answer": "C",
        "list": {
            "A": "special filters",
            "B": "functions",
            "C": "tags",
            "D": "wildcards"
        }
    },
    {
        "question1": "Are you able to integrate a multi-factor token service with the AWS Platform?",
        "answer": "C",
        "list": {
            "A": "No, you cannot integrate multi-factor token devices with the AWS platform.",
            "B": "Yes, you can integrate private multi-factor token devices to authenticate users to the AWS platform.",
            "C": "Yes, using the AWS multi-factor token devices to authenticate users on the AWS platform."
        }
    },
    {
        "question1": "True or False: When you add a rule to a DB security group, you do not need to specify port number or protocol.",
        "answer": "B",
        "list": {
            "A": "Depends on the RDMS used",
            "B": "TRUE",
            "C": "FALSE"
        }
    },
    {
        "question1": "Is there a limit to the number of groups you can have?",
        "answer": "A",
        "list": {
            "A": "Yes for all users",
            "B": "Yes for all users except root",
            "C": "No",
            "D": "Yes unless special permission granted"
        }
    },
    {
        "question1": "Can I initiate a \"forced failover\" for my Oracle Multi-AZ DB Instance deployment?",
        "answer": "A",
        "note": "http://docs.aws.amazon.com/general/latest/gr/aws_service_limits.html",
        "list": {
            "A": "Yes",
            "B": "Only in certain regions",
            "C": "Only in VPC",
            "D": "No"
        }
    },
    {
        "question1": "Amazon EC2 provides a repository of public data sets that can be seamlessly integrated into AWS cloud-based applications.What is the monthly charge for using the public data sets?",
        "answer": "D",
        "list": {
            "A": "A 1 time charge of 10$ for all the datasets.",
            "B": "1$ per dataset per month",
            "C": "10$ per month for all the datasets",
            "D": "There is no charge for using the public data sets"
        }
    },
    {
        "question1": "In the Amazon RDS Oracle DB engine, the Database Diagnostic Pack and the Database Tuning Pack are only available with _____",
        "answer": "C",
        "list": {
            "A": "Oracle Standard Edition",
            "B": "Oracle Express Edition",
            "C": "Oracle Enterprise Edition",
            "D": "None of these"
        }
    },
    {
        "question1": "Without _____, you must either create multiple AWS accounts-each with its own billing and subscriptions to AWS products-or your employees must share the security credentials of a single AWS account.",
        "answer": "D",
        "list": {
            "A": "Amazon RDS",
            "B": "Amazon Glacier",
            "C": "Amazon EMR",
            "D": "Amazon IAM"
        }
    },
    {
        "question1": "Amazon RDS supports SOAP only through _____.",
        "answer": "D",
        "list": {
            "A": "HTTP or HTTPS",
            "B": "TCP/IP",
            "C": "HTTP",
            "D": "HTTPS"
        }
    },
    {
        "question1": "The Amazon EC2 web service can be accessed using the _____ web services messaging protocol. This interface is described by a Web Services Description Language (WSDL) document.",
        "answer": "A",
        "list": {
            "A": "SOAP",
            "B": "DCOM",
            "C": "CORBA",
            "D": "XML-RPC"
        }
    },
    {
        "question1": "Is creating a Read Replica of another Read Replica supported?",
        "answer": "D",
        "list": {
            "A": "Only in VPC",
            "B": "Yes",
            "C": "Only in certain regions",
            "D": "No"
        }
    },
    {
        "question1": "What is the charge for the data transfer incurred in replicating data between your primary and standby?",
        "answer": "C",
        "list": {
            "A": "Same as the standard data transfer charge",
            "B": "Double the standard data transfer charge",
            "C": "No charge. It is free",
            "D": "Half of the standard data transfer charge"
        }
    },
    {
        "question1": "HTTP Query-based requests are HTTP requests that use the HTTP verb GET or POST and a Query parameter named_____.",
        "answer": "A",
        "list": {
            "A": "Action",
            "B": "Value",
            "C": "Reset",
            "D": "Retrieve"
        }
    },
    {
        "question1": "What happens to the I/O operations while you take a database snapshot?",
        "answer": "D",
        "list": {
            "A": "I/O operations to the database are suspended for an hour while the backup is in progress.",
            "B": "I/O operations to the database are sent to a Replica (if available) for a few minutes while the backup is in progress.",
            "C": "I/O operations will be functioning normally",
            "D": "I/O operations to the database are suspended for a few minutes while the backup is in progress."
        }
    },
    {
        "question1": "Amazon RDS creates an SSL certificate and installs the certificate on the DB Instance when Amazon RDS provisions the instance. These certificates are signed by a certificate authority. The _____ is stored athttps://rds.amazonaws.com/doc/rds-ssl-ca-cert.pem.",
        "answer": "A",
        "list": {
            "A": "private key",
            "B": "foreign key",
            "C": "public key",
            "D": "protected key"
        }
    },
    {
        "question1": "_____ embodies the \"share-nothing\" architecture and essentially involves breaking a large database into several smaller databases. Common ways to split a database include 1)splitting tables that are not joined in the same query onto different hosts or 2)duplicating a table across multiple hosts and then using a hashing algorithm to determine which host receives a given update.",
        "answer": "A",
        "list": {
            "A": "Sharding",
            "B": "Failure recovery",
            "C": "Federation",
            "D": "DDL operations"
        }
    },
    {
        "question1": "What is the name of licensing model in which I can use your existing Oracle Database licenses to run Oracle deployments on Amazon RDS?",
        "answer": "A",
        "list": {
            "A": "Bring Your Own License",
            "B": "Role Bases License",
            "C": "Enterprise License",
            "D": "License Included"
        }
    },
    {
        "question1": "When you resize the Amazon RDS DB instance, Amazon RDS will perform the upgrade during the next maintenance window. If you want the upgrade to be performed now, rather than waiting for the maintenance window, specify the _____ option.",
        "answer": "D",
        "list": {
            "A": "ApplyNow",
            "B": "ApplySoon",
            "C": "ApplyThis",
            "D": "ApplyImmediately"
        }
    },
    {
        "question1": "Does Amazon Route 53 support NS Records?",
        "answer": "D",
        "list": {
            "A": "Yes, it supports Name Service records.",
            "B": "No",
            "C": "It supports only MX records.",
            "D": "Yes, it supports Name Server records."
        }
    },
    {
        "question1": "The SQL Server _____ feature is an efficient means of copying data from a source database to your DB Instance. It writes the data that you specify to a data file, such as an ASCII file.",
        "answer": "A",
        "list": {
            "A": "bulk copy",
            "B": "group copy",
            "C": "dual copy",
            "D": "mass copy"
        }
    },
    {
        "question1": "In the Amazon cloud watch, which metric should I be checking to ensure that your DB Instance has enough free storage space?",
        "answer": "B",
        "list": {
            "A": "FreeStorage",
            "B": "FreeStorageVolume",
            "C": "FreeStorageSpace",
            "D": "FreeStorageAllocation"
        }
    },
    {
        "question1": "When using consolidated billing there are two account types. What are they?",
        "answer": "A",
        "list": {
            "A": "Paying account and Linked account",
            "B": "Parent account and Child account",
            "C": "Main account and Sub account.",
            "D": "Main account and Secondary account."
        }
    },
    {
        "question1": "A_____is a document that provides a formal statement of one or more permissions.",
        "answer": "A",
        "list": {
            "A": "policy",
            "B": "permission",
            "C": "Role",
            "D": "resource"
        }
    },
    {
        "question1": "In the Amazon RDS which uses the SQL Server engine, what is the maximum size for a Microsoft SQL Server DB Instance with SQL Server Express edition?",
        "answer": "A",
        "list": {
            "A": "10 GB per DB",
            "B": "100 GB per DB",
            "C": "2 TB per DB",
            "D": "1TB per DB"
        }
    },
    {
        "question1": "Regarding the attaching of ENI to an instance, what does 'warm attach' refer to?",
        "answer": "A",
        "list": {
            "A": "Attaching an ENI to an instance when it is stopped.",
            "B": "This question doesn t makesense.",
            "C": "Attaching an ENI to an instance when it is running",
            "D": "Attaching an ENI to an instance during the launch process"
        }
    },
    {
        "question1": "If I scale the storage capacity provisioned to my DB Instance by mid of a billing month, how will I be charged?",
        "answer": "B",
        "list": {
            "A": "you will be charged for the highest storage capacity you have used",
            "B": "on a proration basis",
            "C": "you will be charged for the lowest storage capacity you have used"
        }
    },
    {
        "question1": "You can modify the backup retention period; valid values are 0 (for no backup retention) to a maximum of _____ days.",
        "answer": "B",
        "list": {
            "A": "45",
            "B": "35",
            "C": "15",
            "D": "5"
        }
    },
    {
        "question1": "A Provisioned IOPS volume must be at least _____ GB in size",
        "answer": "D",
        "list": {
            "A": "1",
            "B": "50",
            "C": "20",
            "D": "10"
        }
    },
    {
        "question1": "Will I be alerted when automatic failover occurs?",
        "answer": "C",
        "list": {
            "A": "Only if SNS configured",
            "B": "No",
            "C": "Yes",
            "D": "Only if Cloud watch configured"
        }
    },
    {
        "question1": "You must increase storage size in increments of at least _____ %",
        "list": {
            "A": "40",
            "B": "20",
            "C": "50",
            "D": "10 "
        },
        "answer": "D"
    },
    {
        "question1": "Read Replicas require a transactional storage engine and are only supported for the _____ storage engine  ",
        "list": {
            "A": "OracleISAM",
            "B": "MSSQLDB",
            "C": "InnoDB",
            "D": "MyISAM"
        },
        "answer": "C"
    },
    {
        "question1": "Are Reserved Instances available for Multi-AZ Deployments?",
        "list": {
            "A": "Only for Cluster Compute instances",
            "B": "Yes for all instance types",
            "C": "Only for M3 instance types",
            "D": "No"
        },
        "answer": "B"
    },
    {
        "question1": "Can we attach an EBS volume to more than one EC2 instance at the same time?",
        "list": {
            "A": "Yes.",
            "B": "No",
            "C": "Only EC2-optimized EBS volumes.",
            "D": "Only in read mode."
        },
        "answer": "B"
    },
    {
        "question1": "In the 'Detailed' monitoring data available for your Amazon EBS volumes, Provisioned IOPS volumes automatically send _____ minute metrics to Amazon CloudWatch.",
        "list": {
            "A": "5",
            "B": "2",
            "C": "1",
            "D": "3"
        },
        "answer": "C"
    },
    {
        "question1": "Can the string value of 'Key' be prefixed with :aws:\"?",
        "list": {
            "A": "No",
            "B": "Only for EC2 not S3",
            "C": "Yes",
            "D": "Only for S3 not EC2"
        },
        "answer": "A"
    },
    {
        "question1": "What does Amazon RDS stand for?",
        "list": {
            "A": "Regional Data Server.",
            "B": "Relational Database Service.",
            "C": "Nothing.",
            "D": "Regional Database Service."
        },
        "answer": "B"
    },
    {
        "question1": "What does Amazon EBS stand for?",
        "list": {
            "A": "Elastic Block Storage.",
            "B": "Elastic Business Server.",
            "C": "Elastic Blade Server.",
            "D": "Elastic Block Store."
        },
        "answer": "D"
    },
    {
        "question1": "Amazon Glacier is designed for?",
        "list": {
            "A": "active database storage",
            "B": "infrequently accessed data",
            "C": "frequently accessed data",
            "D": "cached session data"
        },
        "answer": "B",
        "note": "Glacier is an archival storage service. You're charged every-time you access data over the free tier threshold. When you put data in Glacier you want to have a reasonable expectation that you'll at most need to recover a small portion at most per-month unless there is a disaster/emergency scenario."
    },
    {
        "question1": "Your web application front end consists of multiple EC2 instances behind an Elastic Load Balancer. You configured ELB to perform health checks on these EC2 instances. If an instance fails to pass health checks, which statement will be true?",
        "list": {
            "A": "The instance is replaced automatically by the ELB",
            "B": "The instance gets terminated automatically by the ELB",
            "C": "The ELB stops sending traffic to the instance that failed its health check",
            "D": "The instance gets quarantined by the ELB for root cause analysis"
        },
        "answer": "C",
        "note": "ELBs are deigned to dynamically forward traffic to the eth0 interface of some set of ec2 instances in one or more availability zones of a single region. When monitoring is setup the ELB will see that the instance isn't responding and stop sending traffic to the failed instance."
    },
    {
        "question1": "You are building a system to distribute confidential training videos to employees. Using CloudFront, what method could be used to serve content that is stored in S3, but not publically accessible from S3 directly?",
        "list": {
            "A": "Create an Origin Access Identity (OAI) for CloudFront and grant access to the objects in your S3 bucket to that OAI.",
            "B": "Add the CloudFront account security group “amazon-cf/amazon-cf-sg” to the appropriate S3 bucket policy.",
            "C": "Create an Identity and Access Management (IAM) User for CloudFront and grant access to the objects in your S3 bucket to that IAM User.",
            "D": "Create a S3 bucket policy that lists the CloudFront distribution ID as the Principal and the target bucket as the Amazon Resource Name (ARN)."
        },
        "answer": "A",
        "note": "CloudFront is a CDN capability that distributes S3 objects geographically. An OAI is sort of like a service account for a CloudFront distribution. Using an OAI you can restrict access to S3 content effectively preventing direct access to content in S3 but still allowing CloudFront access to distribute that data."
    },
    {
        "question1": "Which of the following will occur when an EC2 instance in a VPC (Virtual Private Cloud) with an associated Elastic IP is stopped and started?",
        "list": {
            "A": "The Elastic IP will be dissociated from the instance",
            "B": "All data on instance-store devices will be lost",
            "C": "All data on EBS (Elastic Block Store) devices will be lost",
            "D": "The ENI (Elastic Network Interface) is detached"
        },
        "answer": "B",
        "note": "It's important in this question to note that the instance is in a VPC to rule out other answers. Any instance storage device is only persisted during the running life of the instance because instance storage is physically attached to the host rather than NAS storage like EBS. Now part of the reason that instance storage only persists while an instance is powered on is because the host could/always changes when the instance is started. Remember that instance resources are very loosely coupled with other resources. When you start an instance it gets a resource reservation on a carefully chosen, presumably with some complex algorithm, available host."
    },
    {
        "question1": "In the basic monitoring package for EC2, Amazon CloudWatch provides the following metrics:",
        "list": {
            "A": "web server visible metrics such as number failed transaction requests",
            "B": "operating system visible metrics such as memory utilization",
            "C": "database visible metrics such as number of connections",
            "D": "hypervisor visible metrics such as CPU utilization"
        },
        "answer": "D",
        "note": "A responsibility boundary exists between the hypervisor and guest operating system. AWS does not have access to the guest operating system and therefore cannot see anything that isn't visible to the hypervisor. Such information would be resource demands of the guest operating system that the hypervisor must service like, CPU usage. Refer back to the shared responsibility model discussed in the AWS Security Whitepaper. http://d36cz9buwru1tt.cloudfront.net/pdf/AWS_Security_Whitepaper.pdf"
    },
    {
        "question1": "Which is an operational process performed by AWS for data security?",
        "list": {
            "A": "AES-256 encryption of data stored on any shared storage device",
            "B": "Decommissioning of storage devices using industry-standard practices",
            "C": "Replication of data across multiple AWS Regions",
            "D": "Secure wiping of EBS data when an EBS volume is unmounted"
        },
        "answer": "B",
        "note": " The key to this question is understanding again the shared responsibility boundary between AWS and its customers as well as the specific statement \"operational process\". Again we need to refer to the AWS Security Whitepaper. As a standard practice AWS shreds all physical disks after magnetically wiping them as part of their decommissioning process. "
    },
    {
        "question1": "To protect S3 data from both accidental deletion and accidental overwriting, you should:",
        "list": {
            "A": "enable S3 versioning on the bucket",
            "B": "access S3 data using only signed URLs",
            "C": "disable S3 delete using an IAM bucket policy",
            "D": "enable S3 Reduced Redundancy Storage"
        },
        "answer": "A",
        "note": "By enabling versioning you ensure that if accidentally or otherwise overwritten any previous object version is persisted as a previous version. In addition you protect against complete loss from accidental deletion"
    }
]